---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpanhookLeftDirn1
source: html/333461a8-c663-899f-87b5-6e95820164d0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpanhookLeftDirn1 Property

"Hook Angle Left"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemSpanhookLeftDirn1 { get; }
```